const athkarData = [
    {
        id:null,
        repete:100,
        script:"سبحان الله وبحمده",
        fadl : "من قال سبحان الله وبحمده حين يمسي مائة مرة حطت خطاياه وإن كانت مثل زَبَد البحر",
        type:1
    },
    {
        id:null,
        repete:3,
        script:"استغفر الله ",
        fadl : null,
        type:4
    },
    {
        id:null,
        repete:1,
        script:"اللهم أنت السلام ومنك السلام تباركت يا ذا الجلال و الأكرام",
        fadl : null,
        type:4
    },
    {
        id:null,
        repete:33,
        script:"سبحان الله والحمد لله و الله أكبر",
        fadl : null,
        type:4
    },
    {
        id:null,
        repete:10,
        script:"لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، يُحيـي وَيُمـيتُ وهُوَ على كُلّ شيءٍ قدير. ",
        fadl : "عَشْر مَرّات بَعْدَ المَغْرِب وَالصّـبْح",
        type:4
    },
    {
        id:null,
        repete:1,
        script:"اللّهُـمَّ إِنِّـي أَسْأَلُـكَ عِلْمـاً نافِعـاً وَرِزْقـاً طَيِّـباً ، وَعَمَـلاً مُتَقَـبَّلاً",
        fadl : null,
        type:4
    },
    {
        id:null,
        repete:1,
        script:"لا إلهَ إلاّ اللّهُ وحدَهُ لا شريكَ لهُ، لهُ المُـلْكُ ولهُ الحَمْد، وهوَ على كلّ شَيءٍ قَدير، اللّهُـمَّ لا مانِعَ لِما أَعْطَـيْت، وَلا مُعْطِـيَ لِما مَنَـعْت، وَلا يَنْفَـعُ ذا الجَـدِّ مِنْـكَ الجَـد. ",
        fadl : null,
        type:4
    },
    {
        id:null,
        repete:1,
        script:"قراءة سورة الإخلاص و الفلق والناس",
        fadl : "ثلاث مرات بعد صلاتي الفجر والمغرب. ومرة بعد الصلوات الأخرى.",
        type:4
    },
    {
        id:null,
        repete:1,
        script:"آية الكرسي",
        fadl : null,
        type:4
    },
    {
        id:null,
        repete:1,
        script:" سورة الإخلاص و المعوذتين ",
        fadl : null,
        type:5
    },
    {
        id:null,
        repete:3,
        script:"رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً",
        fadl : "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة.",
        type:5
    },
    {
        id:null,
        repete:1,
        script:"اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ",
        fadl : "من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح",
        type:2
    },
    {
        id:null,
        repete:1,
        script:"بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـم. ",
        fadl : "لم يضره من الله شيء",
        type:1
    },
    {
        id:null,
        repete:1,
        script:"اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور.",
        fadl : null,
        type:5
    },
    {
        id:null,
        repete:1,
        script:"سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه.",
        fadl : null,
        type:1
    },
    {
        id:null,
        repete:1,
        script:"أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـين ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم ، فَـتْحَهُ ، وَنَصْـرَهُ ، وَنـورَهُ وَبَـرَكَتَـهُ ، وَهُـداهُ ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه.",
        fadl : null,
        type:1
    },
    {
        id:null,
        repete:1,
        script:"اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد.",
        fadl : "من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.",
        type:5
    },
    {
        id:null,
        repete:0,
        script:"اللهم إني أعوذ بك أن أشرك بك شيئًا وأنا أعلم، وأستغفرك لما لا أعلم",
        fadl : null,
        type:1
    },
    {
        id:null,
        repete:100,
        script:"أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ ",
        fadl : "مائة حسنة، ومُحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان حتى يمسى",
        type:1
    },
    {
        id:null,
        repete:1,
        script:"آخر آيتين من سورة البقرة",
        fadl : "من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه.",
        type:2
    },
    {
        id:null,
        repete:1,
        script:"أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر",
        fadl : null,
        type:2
    },
    {
        id:null,
        repete:0,
        script:"اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك",
        fadl : "من قالها أعتقه الله من النار.",
        type:2
    },
    {
        id:null,
        repete:1,
        script:"اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر",
        fadl : "من قالها حين يمسى أدى شكر يومه.",
        type:2
    },
    {
        id:null,
        repete:1,
        script:"اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ",
        fadl : null,
        type:2
    },
    {
        id:null,
        repete:1,
        script:"أَمْسَيْنا وَأَمْسَى الْمُلْكُ للهِ رَبِّ الْعَالَمَيْنِ، اللَّهُمَّ إِنَّي أسْأَلُكَ خَيْرَ هَذَه اللَّيْلَةِ فَتْحَهَا ونَصْرَهَا، ونُوْرَهَا وبَرَكَتهَا، وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فيهِا وَشَرَّ مَا بَعْدَهَا",
        fadl : null,
        type:2
    },
    {
        id:null,
        repete:100,
        script:"سُبْحـانَ اللهِ وَبِحَمْـدِهِ.",
        fadl:"حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.",
        type:2
    },
    {
        id:null,
        repete:1,
        script:"بِاسْمِكَ رَبِّـي وَضَعْـتُ جَنْـبي ، وَبِكَ أَرْفَعُـه، فَإِن أَمْسَـكْتَ نَفْسـي فارْحَـمْها ، وَإِنْ أَرْسَلْتَـها فاحْفَظْـها بِمـا تَحْفَـظُ بِه عِبـادَكَ الصّـالِحـين.",
        fadl:null,
        type:3,
    },
    {
        id:null,
        repete:1,
        script:"اللّهُـمَّ إِنَّـكَ خَلَـقْتَ نَفْسـي وَأَنْـتَ تَوَفّـاهـا لَكَ ممَـاتـها وَمَحْـياها ، إِنْ أَحْيَيْـتَها فاحْفَظْـها ، وَإِنْ أَمَتَّـها فَاغْفِـرْ لَـها . اللّهُـمَّ إِنَّـي أَسْـأَلُـكَ العـافِـيَة. ",
        fadl:null,
        type:3,
    },
    {
        id:null,
        repete:1,
        script:"اللّهُـمَّ قِنـي عَذابَـكَ يَـوْمَ تَبْـعَثُ عِبـادَك",
        fadl:null,
        type:3,
    },
    {
        id:null,
        repete:1,
        script:"بِاسْـمِكَ اللّهُـمَّ أَمـوتُ وَأَحْـيا.",
        fadl:null,
        type:3,
    },
    {
        id:null,
        repete:1,
        script:"بِاسْـمِكَ اللّهُـمَّ أَمـوتُ وَأَحْـيا.",
        fadl:null,
        type:3,
    },
    {
        id:null,
        repete:33,
        script:"سُبْحَانَ اللَّهِ و الْحَمْدُ لِلَّهِ و اللَّهُ أَكْبَرُ",
        fadl:null,
        type:3,
    },
    {
        id:null,
        repete:1,
        script:"آخر آيتين من سورة البقرة",
        fadl : "من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه.",
        type:3
    },
    {
        id:null,
        repete:1,
        script:"آية الكرسي",
        fadl:null,
        type:3,
    },
]

module.exports = {
    athkarData
}