import Thikr from './Thikr';
import { thikrType } from '../types/ThikrTypes';
import { useMemo, useState,useContext } from 'react';
import {v4 as uuidv4} from 'uuid';
import { DarkModeContext } from '../../contexts/DarkModeContext';
import ArrowBackRoundedIcon from '@mui/icons-material/ArrowBackRounded';
import { Link } from 'react-router-dom';
const Athkar = ()=>{

    const [thikrName ,setThikrName] = useState("AthkarSabah");
    const [reset , setReset] = useState(false);
    const darkMode = useContext(DarkModeContext);

    


    const AthkarSabah:thikrType[] =[
        {
            script : `أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ "
            اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ "  [آية الكرسى - البقرة 255]`,
            info:"من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح",
            repete:1,
        },
        {
            script:`بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
             قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ. `,
             info:"من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين). ",
             repete:3,
        },
        {
            script:`
            بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
            قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.
            `,
            info:"من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين). ",
            repete:3,
        },
        {
            script:`
            بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
            قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.
            `,
            info:"من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين). ",
            repete:3,
        },
        {
            script:`أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر. `,
            info:null,
            repete:1,
        },
        {
            script:`
            اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .
            `,
            info:"من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح.",
            repete:1,
        },
        {
            script:`رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.`,
            info:"من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة.",
            repete:3,
        },
        {
            script:"اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد.",
            info:"من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.",
            repete:10,
        },
    ]
    const AthkarMasaa:thikrType[] =[
            {
            script : `أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ
            اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255]`,
            info:"من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح",
            repete:1,
            },            
            {
                script:`أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ
                آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ. [البقرة 285 - 286].`,
                info:"من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه.",
                repete:1,
            },
            {
                script:`أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.`,
                info:null,
                repete:1,
            },
            {
                script:`اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ . `,
                info:"من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح.",
                repete:1,
            },
            {
                script:`رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً. `,
                info:"من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة",
                repete:3,
            },
            {
                script:`اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.`,
                info:"من قالها حين يمسى أدى شكر يومه",
                repete:1,
            }
    ]

    const AthkarNawm:thikrType[] = [
        {
            script:"بِاسْمِكَ رَبِّـي وَضَعْـتُ جَنْـبي ، وَبِكَ أَرْفَعُـه، فَإِن أَمْسَـكْتَ نَفْسـي فارْحَـمْها ، وَإِنْ أَرْسَلْتَـها فاحْفَظْـها بِمـا تَحْفَـظُ بِه عِبـادَكَ الصّـالِحـين. ",
            info:null,
            repete:1,
        },
        {
            script:"اللّهُـمَّ إِنَّـكَ خَلَـقْتَ نَفْسـي وَأَنْـتَ تَوَفّـاهـا لَكَ ممَـاتـها وَمَحْـياها ، إِنْ أَحْيَيْـتَها فاحْفَظْـها ، وَإِنْ أَمَتَّـها فَاغْفِـرْ لَـها . اللّهُـمَّ إِنَّـي أَسْـأَلُـكَ العـافِـيَة. ",
            info:null,
            repete:1,
        },
        {
            script:"بِاسْـمِكَ اللّهُـمَّ أَمـوتُ وَأَحْـيا. ",
            info:null,
            repete:1,
        },
        {
            script:"سُبْحَانَ اللَّهِ.",
            info:null,
            repete:33,
        },
        {
            script:"الْحَمْدُ لِلَّهِ.",
            info:null,
            repete:33,
        },
        {
            script:"اللَّهُ أَكْبَرُ. ",
            info:null,
            repete:33,
        },
        {
            script:`آية الكرسى: أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ
            اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [البقرة 255]`,
            info:"أجير من الجن حتى يصبح.",
            repete:1,
        },
        {
            script:`سورة البقرة: أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ
            آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ. [البقرة 285 - 286]`,
            info:"من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه.",
            repete:1,
        }
    ]

    const AthkarIstikad:thikrType[] =[
        {
            script:`الحَمْـدُ لِلّهِ الّذي أَحْـيانا بَعْـدَ ما أَماتَـنا وَإليه النُّـشور.`,
            info:null,
            repete:1,
        },
        {
            script:`لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شَـريكَ له، لهُ المُلـكُ ولهُ الحَمـد، وهوَ على كلّ شيءٍ قدير، سُـبْحانَ اللهِ، والحمْـدُ لله ، ولا إلهَ إلاّ اللهُ واللهُ أكبَر، وَلا حَولَ وَلا قوّة إلاّ باللّهِ العليّ العظيم. رَبِّ اغْفرْ لي. `,
            info:null,
            repete:1,
        },
    ]


    let arrayTobeCalculated:thikrType[] = AthkarSabah;
    useMemo(()=>{
        switch (thikrName){
            case "AthkarSabah" :
                arrayTobeCalculated = AthkarSabah;
                break;
            case "AthkarMasaa":
                arrayTobeCalculated = AthkarMasaa;
                break;
            case "AthkarNawm":
                arrayTobeCalculated = AthkarNawm;
                break;
            case "AthkarIstikad" :
                arrayTobeCalculated = AthkarIstikad;
                break;
            default: 
            arrayTobeCalculated = AthkarSabah;
        }

    },[thikrName]);

    return(
        <div className={darkMode.state ?"dark":""}>
            <div className='dark:bg-blue1 overflow-x-hidden'>
                <h1 className='text-5xl font-bold font-changa text-blue1 translate-x-[40%] translate-y-[90%] dark:text-[#FFFF] md:translate-x-[46%]'>أذكار</h1>
                <Link to="/"><button className='bg-blue2 text-[#FFFF] w-[50px] h-[50px] rounded-[1400px] relative left-4 bottom-20 dark:text-blue1 dark:bg-[#FFFF]'><ArrowBackRoundedIcon  fontSize='large'/></button></Link>
                <select className="w-[70%] bg-blue4 text-blue1  font-changa font-bold cursor-pointer h-[40px]  ml-11 mt-16 rounded-lg outline-none
                    dark:bg-blue2 dark:text-[#FFFF]
                    md:w-[60%] md:translate-x-[30%]
                    pl-3
                "
                    onChange={(e)=>setThikrName(e.target.value)}
                >
                    <option value="AthkarSabah">أذكار الصباح</option>
                    <option value="AthkarMasaa">أذكار المساء</option>
                    <option value="AthkarNawm">أذكار النوم</option>
                    <option value="AthkarIstikad">أذكار الإستيقاظ من النوم</option>
                </select>


                {
                    arrayTobeCalculated.map((element)=>{
                        return(
                            <Thikr script={element.script} info={element.info} repete={element.repete} reset={reset} setReset={setReset}  key={uuidv4()} />
                        );
                    })
                }


            </div>
        </div>
    )
}

export default Athkar;